import React, { Component } from "react";
import ImgPhoto from "../imgs/Lviv.jpg";
export default class Content extends Component {
	ChangeColors(el) {
		let vars = "0123456789ABCDEF";
		let color1 = "#";
		let color2 = "#";
		do {
			for (let i = 0; i < 6; i++) {
				color1 += vars[Math.floor(Math.random() * 16)];
				color2 += vars[Math.floor(Math.random() * 16)];
			}
		} while (color1 === color2);
		el.target.style.color = color1;
		el.target.style.backgroundColor = color2;
	}
	render() {
		return (
			<>
				<p>Хобі:</p>
				<ul>
					<li>Спорт</li>
					<li>Малювання</li>
					<li>Шахи</li>
				</ul>
				<p>Улюблені фільми:</p>
				<ol>
					<li>"1+1", 2011</li>
					<li>"Втеча з Шоушенка", 1994</li>
					<li>"Зелена миля", 1999</li>
				</ol>
				<p id="first-paragraph" onClick={this.ChangeColors}>
					Львів — місто в Україні, адміністративний центр області, агломерації,
					району, міської громади, національно-культурний та освітньо-науковий
					осередок країни, великий промисловий центр і транспортний вузол,
					вважається столицею Галичини та центром Західної України.
				</p>
				<p id="second-paragraph" onClick={this.ChangeColors}>
					Львів заснував король Данило приблизно у 1231—1235 роках (перша згадка
					від 1256 року). Близько 1272 року місто стало столицею Королівства
					Русі (Галицько-Волинського князівства). Невдовзі після смерті князя
					Юрія II Львів на понад чотири століття опинився під владою Королівства
					Польського. 1356 року місто отримало маґдебурзьке право; в добу
					Середньовіччя Львів був важливим торговельним центром. За
					австрійського панування місто стало осередком українського та
					польського національного рухів. Після розпаду Австро-Угорщини восени
					1918 року Львів деякий час був столицею Західноукраїнської Народної
					Республіки, але після українсько-польської битви за місто в листопаді
					1918 перейшов до Польщі, що в 1922-23 було визнано міжнародними
					пактами та угодами. Під час Другої світової війни місто захопив
					Радянський Союз, а згодом — Німеччина. Після війни було юридично
					закріплено ялтинську угоду 1945, за якою Східна Галичина і зокрема
					Львів лишався у складі Української РСР. 1946 року між Польщею та УРСР
					відбувся обмін населення, який разом із наслідками війни суттєво
					вплинув на населення Львова. З 1991 року Львів перебуває у складі
					України.
				</p>
				<div className="photos">
					<a href="https://www.032.ua/" className="link">
						<img src={ImgPhoto} alt="Lviv" width="400" height="280" />
					</a>
				</div>
			</>
		);
	}
}
